extends RoomEvent

# เช็คก่อนย้ายห้อง 
func can_pass(dir: String) -> bool:
	# logic หากมีเงื่อนไขในการผ่าน
	match dir:
		_:
			return true
			
func start(_args=[]):
	Tell("คุณตื่นขึ้นมาที่ไหนไม่รู้ สภาพของห้องดูเหมือนจะมีแค่ไฟสลัวๆ ไม่ค่อยเห็นอะไรมากนัก")
	Tell("บางทีการ[cmd]ดู[/cmd]รอบๆ อาจจะเห็นอะไรมากขึ้นก็ได้นะ")

# event ตอนเข้าห้อง
func enter_room(_args=[]):
	Tell(get_data.call("name"))

func look(_args=[]):
	Tell("คุณใช้เวลาในการปรับสายตาสักครู่")
	Tell("เมื่อลองมองดีแล้วๆ ที่นี่ดูเหมือนจะเป็นห้องเล็กๆ น่าจะเรียกได้ว่าเป็น[room]ห้องอ่านหนังสือ[/room]ก็ได้")
	Tell("มี[thing]โต๊ะ[/thing]สำหรับอ่านหนังสืออยู่ มันมี[thing]หนังสือปริศนา[/thing]วางทิ้งไว้ และ[thing]ชั้นหนังสือ[/thing]ที่มีหนังสือเรียงรายอยู่มากมาย")
	Tell("คุณสังเหตุเห็นว่าในทิศ[dir]เหนือ[/dir]นั้นมีประตูไม้บานเล็กปิดอยู่")

# custom look_something event
func look_something(thing :String):
	match thing:
		"โต๊ะ":
			Tell("โต๊ะไง อิอิ")
			# เติมให้หน่อยกั๊บ
			pass
		"ชั้นหนังสือ":
			Tell("ชั้นหนังสือไง อิอิ")
			# เติมให้หน่อยกั๊บ
			pass
		"ห้องลับ":
			Tell("เห้ย รู่ได้ไงว่ามีห้องลับ ขี้โกงนี่นา")
		_:
			Tell("ดูเหมือนว่าจะไม่มี \""+thing+"\" อยู่ที่นี่")
	pass
	
