extends RoomEvent

# เช็คก่อนย้ายห้อง 
func can_pass(dir:String)->bool:
	# logic หากมีเงื่อนไขในการผ่าน
	match dir:
		_:
			return true
			
			
func start(_args=[]):
	Printf("คุณตื่นขึ้นมาที่ไหนไม่รู้ สภาพของห้องดูเหมือนจะมีแค่ไฟสลัวๆ ไม่ค่อยเห็นอะไรมากนัก")
	Printf("บางทีการดูรอบๆ อาจจะเห็นอะไรมากขึ้นก็ได้นะ")
	Printf("พิมพ์ 'ดู' แล้วกด Enter เพื่อสำรวจ")

# event ตอนเข้าห้อง
func enter_room(_args=[]):
	Printf("เข้ามายัง "+ get_data.call("name"))

func look(_args=[]):
	Printf("คุณใช้เวลาในการปรับสายตาสักครู่")
	Printf("เมื่อลองมองดีแล้วๆ ที่นี่ดูเหมือนจะเป็นห้องเล็กๆ น่าจะเรียกได้ว่าเป็นห้องอ่านหนังสือก็ได้")
	Printf("มี \"โต๊ะ\" สำหรับอ่านหนังสืออยู่นยังคงมีหนังสือเปิดค้างอยู่ \"ชั้นหนังสือ\"มีหนังสือเรียงรายอยู่มากมาย")
	Printf("อ่ะ ดูเหมือนว่าทาง \"เหนือ\" จะมีประตูทางออกอยู่ด้วยนะ")

# custom look_something event
func look_something(thing :String):
	match thing:
		"โต๊ะ":
			Printf("โต๊ะ ไง อิอิ")
			# เติมให้หน่อยกั๊บ
			pass
		"ชั้นหนังสือ":
			Printf("ชั้นหนังสือ ไง อิอิ")
			# เติมให้หน่อยกั๊บ
			pass
		"ห้องลับ":
			Printf("เห้ย รู่ได้ไงว่ามีห้องลับ ขี้โกงนี่นา")
		_:
			Printf("ดูเหมือนว่าจะไม่มี \""+thing+"\" อยู่ที่นี่")
	pass
	
